In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df =pd.read_excel('Documents//datasets//salarydataset.xlsx')

In [4]:
df.head()

  Company           Job     degree  salary above 100k
0  google  sales execut  bachalors                  0
1  google  sales execut     maters                  0
2  google   biz manager  bachalors                  1
3  google   biz manager     maters                  1
4  google    programmer  bachalors                  0

In [5]:
df.shape

(16, 4)

# dropping row

In [9]:
inputs = df.drop('salary above 100k' ,axis='columns')

In [31]:
target =df['salary above 100k'] # target = dropped column

In [11]:
inputs

     Company           Job     degree
0     google  sales execut  bachalors
1     google  sales execut     maters
2     google   biz manager  bachalors
3     google   biz manager     maters
4     google    programmer  bachalors
5     google    programmer     maters
6   ab pharm  sales execut  bachalors
7   ab pharm    programmer     maters
8   ab pharm   biz manager  bachalors
9   ab pharm   biz manager     maters
10  facebook  sales execut  bachalors
11  facebook  sales execut     maters
12  facebook   biz manager  bachalors
13  facebook   biz manager     maters
14  facebook    programmer  bachalors
15  facebook    programmer     maters

target

# importing label encoder

In [15]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()

# creating 3 objects of label encoder

In [16]:
le_job = LabelEncoder()
le_degree =le = LabelEncoder()

# creating additional row to the initial table -inputs

In [19]:
inputs['ompany_N'] = le_company.fit_transform(inputs['Company'])
inputs['job_N'] = le_company.fit_transform(inputs['Job'])
inputs['degree_N'] = le_company.fit_transform(inputs['degree'])

In [20]:
inputs.head()

  Company           Job     degree  ompany_N  job_N  degree_N
0  google  sales execut  bachalors         2      2         0
1  google  sales execut     maters         2      2         1
2  google   biz manager  bachalors         2      0         0
3  google   biz manager     maters         2      0         1
4  google    programmer  bachalors         2      1         0

# dropping none digits columns

In [22]:
input_n = inputs.drop(['Company' ,'Job' ,'degree'],axis='columns')

In [24]:
input_n

    ompany_N  job_N  degree_N
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0
5          2      1         1
6          0      2         0
7          0      1         1
8          0      0         0
9          0      0         1
10         1      2         0
11         1      2         1
12         1      0         0
13         1      0         1
14         1      1         0
15         1      1         1

# import decision tree

In [26]:
from sklearn import tree

In [27]:
model = tree.DecisionTreeClassifier()

In [28]:
model.fit(input_n ,target)

DecisionTreeClassifier()

# accuracy of the model

In [29]:
model.score(input_n ,target)

1.0

# making prediction for google	sales execut	bachalors --2,2,0

In [32]:
model.predict([[2,2,0]]) # salary is not above 100k

array([0])

# making prediction for google	biz manager	bachalors

In [33]:
model.predict([[2,0,0]]) #google	programmer	bachalors

array([1])